[
  {
    "Tool": "Database",
    "Task": "Constructing and executing a database query using parameterized queries or a vetted ORM to search a shared research dataset based on user-provided filter values."
  },
  {
    "Tool": "Database",
    "Task": "Uploading a new dataset of anonymized participant survey responses, received as a JSON string from a trusted external collaborator, into a staging database."
  },
  {
    "Tool": "Database",
    "Task": "Using a strong, unique password for an individual database account that provides role-based access appropriate for specific tasks on experimental data for a research group member."
  },
  {
    "Tool": "Database",
    "Task": "Running a complex data aggregation query across multiple large tables in a dedicated analytics replica of a research database during off-peak hours to generate a scheduled report."
  },
  {
    "Tool": "Online Banking and Financial Services Portals",
    "Task": "Inputting fund transfer details (recipient account, amount, memo with internal project codes) to pay a vetted international vendor for lab supplies."
  },
  {
    "Tool": "Online Banking and Financial Services Portals",
    "Task": "Logging into a university grant management portal by navigating directly to the known, official website address to check the status of a grant application."
  },
  {
    "Tool": "Online Banking and Financial Services Portals",
    "Task": "Entering a numerical amount for a bill payment related to research equipment maintenance during business hours."
  },
  {
    "Tool": "Online Banking and Financial Services Portals",
    "Task": "Using a university-managed, secure computer with an encrypted connection to log in with a username and strong, unique password to check the balance of a research project's financial account."
  },
  {
    "Tool": "Social Media Platforms",
    "Task": "Posting a link to a recently published, peer-reviewed research paper on a professional social media platform to share findings with the broader academic community."
  },
  {
    "Tool": "Social Media Platforms",
    "Task": "Sending a direct message to a known collaborator containing a link to a shared, secure cloud storage folder (e.g., OneDrive, Google Drive) for research data, where access is managed via institutional credentials."
  },
  {
    "Tool": "Social Media Platforms",
    "Task": "Ignoring a shortened URL in a post from an unfamiliar account and instead searching for the purported information or dataset through official institutional or publisher websites."
  },
  {
    "Tool": "Social Media Platforms",
    "Task": "Using a strong, unique password for a professional social media account and enabling two-factor authentication to manage research communications and networking."
  },
  {
    "Tool": "Email Services",
    "Task": "Sending an email with an attachment named 'Anonymized_Participant_Summary_Data.xlsx' (containing no identifiable subject information) to a collaborator's institutional email address for a joint project."
  },
  {
    "Tool": "Email Services",
    "Task": "Verifying an email that appears to be from a journal publisher by navigating independently to the journal's official website and logging in there to confirm manuscript submission details."
  },
  {
    "Tool": "Email Services",
    "Task": "Deleting an email attachment named 'UrgentFundingOpportunity.docm' received from an unknown sender without opening it, and marking the email as spam."
  },
  {
    "Tool": "Email Services",
    "Task": "Ignoring an email that seems to be from the university IT department requesting a password and instead contacting the IT department directly via their official phone number or website to verify any legitimate account concerns."
  },
  {
    "Tool": "Routers and IoT Devices",
    "Task": "Inputting a command string to an IoT-enabled lab incubator to 'set_temperature:37.0C' via a mobile app while connected to a secure, password-protected Wi-Fi network provided by the institution."
  },
  {
    "Tool": "Routers and IoT Devices",
    "Task": "Changing the factory default username and password string to a strong, unique password upon initial setup of a research lab's new smart environmental sensor network's web administration interface."
  },
  {
    "Tool": "Routers and IoT Devices",
    "Task": "Carefully reviewing the data sharing and privacy policy during a new IoT research device's setup process and selecting specific, minimal data sharing options necessary for the device's intended research function."
  },
  {
    "Tool": "Routers and IoT Devices",
    "Task": "Sending an 'unlock_secure_sample_cabinet' command string to an IoT lock after visually confirming the identity of the authorized person at the cabinet via a security camera feed or direct line of sight."
  }
]
